{
  "id": "0ba63db3-0d51-d3ea-a796-dc28f6173dd0",
  "timestamp": 1646414840.327,
  "keyword": [
    "title:politics",
    "politics",
    "war",
    "guerrilla warfare",
    "warfare",
    "asymmetric warfare",
    "terrorism"
  ],
  "extra": [],
  "note": "Talks about asymmetric warfare and the 'three phases' developed by Mao during the 1930s. The idea is that there are basically three phases for a militarily weaker force that needs to be employed instead of doing a full head on offensive:\n* Guerrilla warfare - sabotage and assination on opposition\n* Mobile Warfare - 'hit-and-run' tactics that quickly target weaker forces then retreat\n* Positional Warfare - convential warfare, attempting to take and hold territory\nSome additional tidbits:\n* Funding more easily comes from a sponsor nation state than from taking enemy resources\n* 'The will of the people' (aka propaganda) and keeping the people's favoritism is key, either through coersion, benefits or mutual hate of the opposition (for example, opposition's use of collective punishment for guerrilla like strikes), to effectively mount insurgency and ultimate victory (that is, mobilize people, not industry)\n* Collatoral damage will be high and lead to oppressive policies from the occupiers (and most likely guide insurgency governments to also be draconian)\n* Being able to gracefully go back down a level if an attempt to advance to a higher level fails helps shield against defeat (Mao thought of 'many small victories' but resilience against many small defeats might also be key)\n* From foreign support comes a need to conform to foreign ideoligy\n* Protracted war is very beatable with most insurgencies losing and depends on the desire of the occupying force vs. the occupied force to win\n* New technologies, with heavy emphasis on media and global communication, can drastically change the course and tactics of protracted war\n* Tactics of the weaker force for a protracted war are born out of necessity. By far, winning wars of quick decisions are more desirable",
  "link": [
    "https://acoup.blog/2022/03/03/collections-how-the-weak-can-win-a-primer-on-protracted-war/"
  ]
}