{
  "id": "7b15c4c9-590d-4c47-b5f1-c3c818febf76",
  "timestamp": 1728758699.039,
  "keyword": [
    "title:meager thoughts",
    "meager thoughts",
    "alan kay",
    "kay",
    "work",
    "research"
  ],
  "extra": [],
  "note": "Alan Kay said, at one point, he gave his researchers 10x more compute so they could have the freedom to explore but also so that the computers they were using were at the speed of the general population when their ideas would come to fruition.\nSome more thoughts on Alan Kay, being a bit more critical:\nKay differentiates invention and innovation, where one is a phase change and the other is incremental.\nnKay says that researchers need computers that are 15 years in the future to make innovative leaps and that students/researchers at universities are working on computers that are in the past, so the chance of their making substantive invention is low. I think this is missing something pretty fundamental, where incremental progress spread out through time and people is the same as concetrating it at in individual level. Take Linux that is $30T+ (consumer side value) but that almost is a point of pride to be developed on low end systems (and unlock the potential of low end systems). This is the difference between scaling up and scaling out and it seems like Kay focuses more on scaling up.\nMore to the point, Kay comes froma corporate background, so scaling up seems like the natural thing to do. Scaling out, in this context, is a much more democratic\nThis is my main critique of Kay. His world is one of patents, trademarks with business being a benevolent dictatorship. In his world, there is a highly concentrated inner circle of highly trained researchers and engineers that have been vetted by top tier institutions that are then put in a sandbox environment, given all the most expensive tools and resources orders of magnitude over everyone else, and allowed to innovate. Businesses 'should' do this because it's in their long term best interest, a sort of longer term greedy thinking.\nThere's a lot to learn from Kay but I don't believe his top down theory on invention, or that there's even a stark divide between invention and innovation. Linux might be considered 'innovation' but the size of value it's created goes well beyond innovation and leads to invention. I think in Kay's universe, FOSS is a blip of an idea, ignoring the fundamental impact it's had at unlocking invention and innovation in nearly every aspect of the internet and computer technology.",
  "link": [
    "https://en.wikipedia.org/wiki/Alan_Kay",
    "https://www.youtube.com/watch?v=gTAghAJcO1o"
  ]
}
