{
  "id": "86c8521a-7965-466a-df3c-38a9bd54fd95",
  "timestamp": 1621598676.395,
  "keyword": [
    "title:cryptocurrency",
    "cryptocurrency",
    "fud",
    "ransomware",
    "stephen diehl",
    "scam",
    "mlm",
    "multi level marketing scheme",
    "anger",
    "money laundering",
    "crime",
    "bitcoin"
  ],
  "extra": [],
  "note": "Stephen Diehl comments further about ransomware being soley enabled by cryptocurrency (and predicts) a huge storm coming. Stephen Diehl also makes a comparison with MLMs and our 'get-rich-quick' vulnerability.\nPaul Krugman writes about Bitcoin being a scam and how government can and will come in to regulate and supress it.\nZach Coelius says\n\n> I challenge anyone to name a crypto use case that can't be better executed by a centralized database except crime. Anyone?\n\nThe Coelius quote sums up most succinctly the push back against cryptocurrency and, in my opinion, it's deep utility. There are legitimate uses of cryptocurrency that get feature parity with fiat currency but people correctly point out that if fiat currency is working, then why bother developing anything that replaces it.\nAlmost by definition, if a financial alternative can be done that circumvents a regulated financial system under government control, it's probably illegal. Cryptocurrency has the potential to circumvent that control. The crime is not really the issue, the morality is. If governments provide illegal but immoral laws preventing a fair financial system, then anything that tries to replace is, almost by definition, illegal. Criminality should never be confused with imorality. Diehl, Krugman and Coelius all make this mistake.\n\nSome other points:\n* I've heard of a few anecdotal stories about Bitcoin being difficult to use but the only alternative to get money to people in certain situations\n* In the late 1800s, the Sears catalog offered black consumers access to goods that were restricted to them from entrenched racist local businesses\n* Wikileaks was able to get funds through cryptocurrency after their bank accounts had been seized by the government\n* Krugman has, as with many othrs, been profoundly wrong about the impact of technology and separating the winners in the technological and business race",
  "link": [
    "https://twitter.com/smdiehl/status/1395684302201966592",
    "https://web.archive.org/save/https://twitter.com/smdiehl/status/1395684302201966592",
    "https://twitter.com/smdiehl/status/1394938539989741573",
    "https://web.archive.org/web/20210519200531/https://twitter.com/smdiehl/status/1394938539989741573",
    "https://twitter.com/ctjlewis/status/1393306175991697410",
    "https://web.archive.org/web/20210514204446/https://twitter.com/ctjlewis/status/1393306175991697410",
    "https://twitter.com/zachcoelius/status/1393646959517261826",
    "https://web.archive.org/web/20210515192536/https://twitter.com/zachcoelius/status/1393646959517261826",
    "https://www.nytimes.com/2021/05/20/opinion/cryptocurrency-bitcoin.html",
    "https://web.archive.org/web/20210521114800/https://www.nytimes.com/2021/05/20/opinion/cryptocurrency-bitcoin.html",
    "https://www.snopes.com/fact-check/paul-krugman-internets-effect-economy/",
    "https://www.businessinsider.com/paul-krugman-responds-to-internet-quote-2013-12",
    "https://web.archive.org/web/20210513212556/https://www.businessinsider.com/paul-krugman-responds-to-internet-quote-2013-12"
  ]
}